tests/api/soap/data/existing_sku.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/07/secext" xmlns:ser="http://service.soap.xxpha.ru/">
  <soapenv:Header>
    <sec:Security>
      <sec:UsernameToken>
        <sec:Username>SOAP_Synchronize_User</sec:Username>
        <sec:Password>6wrSHT35BJHY9FGK</sec:Password>
      </sec:UsernameToken>
    </sec:Security>
  </soapenv:Header>
  <soapenv:Body>
    <ser:addProduct>
      <product>
        <INVENTORY_ITEM_ID>555444111</INVENTORY_ITEM_ID>
        <SEGMENT1>item-id-2</SEGMENT1>
        <DESCRIPTION_RU>название русское</DESCRIPTION_RU>
        <DESCRIPTION_ENG>english name</DESCRIPTION_ENG>
        <UOMID>UOMID 1</UOMID>
        <UOM_US>unit of measure us</UOM_US>
        <UOM_RU>единица измерения рус</UOM_RU>
        <PRODUCER_CODE>pha_producer_41</PRODUCER_CODE>
        <PRODUCER_US>producer us</PRODUCER_US>
        <PRODUCER_RU>производитель ру</PRODUCER_RU>
        <SORT_PACK_US>sort pack us</SORT_PACK_US>
        <SORT_PACK_CODE>pack-id</SORT_PACK_CODE>
        <SORT_PACK_RU>упаковка рус</SORT_PACK_RU>
        <COLOR_US>color us</COLOR_US>
        <COLOR_RU>цвет рус</COLOR_RU>
        <COLOR_CODE>color-id</COLOR_CODE>
        <PRODUCT_DETAIL_US>PRODUCT_DETAIL_US blablabla 1</PRODUCT_DETAIL_US>
        <PRODUCT_DETAIL_CODE>PRODUCT_DETAIL_CODE-1</PRODUCT_DETAIL_CODE>
        <PRODUCT_DETAIL_RU>PRODUCT_DETAIL_RU блаблабла 1</PRODUCT_DETAIL_RU>
        <PRODUCT_DETAIL_2_US>PRODUCT_DETAIL_US blablabla 2</PRODUCT_DETAIL_2_US>
        <PRODUCT_DETAIL_2_CODE>PRODUCT_DETAIL_CODE-2</PRODUCT_DETAIL_2_CODE>
        <PRODUCT_DETAIL_2_RU>PRODUCT_DETAIL_RU блаблабла 2</PRODUCT_DETAIL_2_RU>
        <PARENT_NUMBER>item-id-2</PARENT_NUMBER>
        <ITEM_TYPE>ПОГР тип</ITEM_TYPE>
        <STATUS_OWC>STATUS_OWC 1</STATUS_OWC>
        <CATEGORY_CODE>CATEGORY_CODE-1</CATEGORY_CODE>
        <CATEGORY_RU>CATEGORY_RU блаблабла</CATEGORY_RU>
        <CATEGORY_US>CATEGORY_US blablabla</CATEGORY_US>
        <SEGMENT_CODE>SEGMENT_CODE-1-field</SEGMENT_CODE>
        <SEGMENT_RU>SEGMENT_RU сегмент рус</SEGMENT_RU>
        <SEGMENT_US>SEGMENT_US segment us</SEGMENT_US>
        <PHA_GOST>гост номер такой-то</PHA_GOST>
      </product>
    </ser:addProduct>
  </soapenv:Body>
</soapenv:Envelope>